Revit 2026 API

# ExternalResourceUtils Class

---

A utility class containing functions related to external resource references.

SystemObject Autodesk.Revit.DBExternalResourceUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternalResourceUtils
```
```vb
Public NotInheritable Class ExternalResourceUtils
```
```cpp
public ref class ExternalResourceUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceUtils = class end
```

The ExternalResourceUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAllExternalResourceReferences(Document) | Gets the ids of all elements which refer to external resources. |
|  | GetAllExternalResourceReferences(Document, ExternalResourceType) | Gets the ids of all elements which refer to a specific type of external resource. |

Elements which are external resource references refer to data outside of the base .rvt file. Examples include Revit links and the keynote table data.

#### Reference

Autodesk.Revit.DB Namespace